{
    "Final Touch":"فاينال تاتش",
    "Home":"الرئيسية",
    "Services":"خدماتنا",
    "Experiences":"خبرة",
    "About":"نبذة عنا",
    "Contact":"يتصل",
    "Entertainment Events Leisure Management":"تنظيم الفعاليات الترفيهية وإدارة المناسبات",
    "Event Company (formal, public or private)":"شركة الحدث (رسمية أو عامة أو خاصة)",
    "Vision":"الرؤية",
    "Mission":"الرسالة",
    "Quality":"جودة",
    "Happiness Event":"معرض السعادة",
    "The Hawaiian Event":"حدث هاواي",
    "The Haunted Land":"فعالية هانتد لاند",
    "We Take Your Fun Seriously":"نحن نأخذ مرحك على محمل الجد",
    "Get in touch now":"تواصل معنا الآن",
    "Call Us":"اتصل بنا",
    "Email Us":"ارسل لنا عبر البريد الإلكتروني",
    "Location":"موقعنا",
    "Riyadh, Saudi Arabia":"الرياض، المملكة العربية السعودية",
    "Who we are":"من نحن",
    "Established in 2012":"تأسست عام 2012",
    "Specialize in organizing and developing entertainment, conferences, exhibitions and more":"متخصصون في تنظيم وتطوير الترفيه والمؤتمرات والمعارض وغيرها",
    "We are confident in undertaking full project management of a project from design, to consultation and execution.":"نحن واثقون من استطاعتنا لتولي إدارة مشروع بأكمله، بداية من التصميم إلى الاستشارات والتنفيذ.",
    "We are dedicated to providing the highest quality events and execute successful projects that not only set the best standards but also set the trend for the industry.":" نحن ملتزمون بتوفير أعلى مستويات الجودة للفعاليات وتنفيذ المشاريع الناجحة التي لا تقدم فقط أفضل المعايير ولكن أيضًا تحدد الاتجاه السائد في الصناعة.",
    "You can rely on our quality as we are professionals in the event management, planning and organizing with some of our senior management having years of experience in that specific field.":"يمكنك الاعتماد على جودتنا لأننا محترفون في إدارة المناسبات والتخطيط لها وتنظيمها بإدارتنا العليا الذين لديهم سنوات من الخبرة في هذا المجال المحدد",
    "In 2017 alone, using our knowledge, creativity and experience, we were able to reach out to 40,000 people in the entertainment industry around Saudi Arabia. With our potential to organize all kinds of events in all fields, we planned to stretch the limit in public events and fortunately, we reached our target of 1.5 million people by 2018":"فقط في عام 2017، بمعرفتنا وإبداعنا وخبرتنا، تمكنا من الوصول إلى 40 ألف شخصا في مجال صناعة الترفيه في جميع أنحاء المملكة العربية السعودية. فبقدرتنا على تنظيم جميع أنواع المناسبات في جميع المجالات، اعتزمنا بذل أقصى ما نستطيع بشأن تنظيم المناسبات العامة ولحسن الحظ، وصلنا إلى هدفنا المتمثل في 1.5 مليون شخصا بحلول عام 2018.",
    "We pride ourselves in being efficient partners of companies, agencies, government institutions, designers, producers, promoters and other parties in the events industry":"نحن نفخر بأنفسنا لكوننا شركاء فعالين للشركات والوكالات والمؤسسات الحكومية والمصممين والمنتجين والمروجين وغيرهم من الأطراف في إدارة الأحداث والمناسبات.",
    "Design":"التصمي",
    "from A to Z":"من الألف إلى الياء",
    "Agile":" الرشيقة المش",
    "Benefits Realisation Management (BRM)":"إدارة تحقيق الفوائد",
    "Change Management":"إدارة التغيير",
    "Deliverables":"النواتج المستهدفة",
    "Emotional Intelligence":"الذكاء العاطفي",
    "Failure":"إدارة الفشل",
    "Gantt Charts":"مخططات غانت",
    "Human Resource Management Plan":"خطة إدارة الموارد البشرية",
    "Issue":"إدارة المشكلات وآليات الحل",
    "Jobs":"الوظائف",
    "Key Performance Indicator (KPI)":"مؤشرات الأداء الرئيسية",
    "Lean Project Management":"الإدارة المنهجية",
    "Monitoring":"المراقبة",
    "Non-linear Management (NLM)":"الإدارة غير الخطية",
    "Out of Scope":"خارج النطاق",
    "Phases":"المراحل",
    "Risk Management":"إدارة المخاطر",
    "Scrum":"منهجية سكرم ",
    "Training":"التدريب",
    "User Story":"قصة المستخدم ",
    "Virtual Team":"الفريق الافتراضي",
    "Waterfall":"منهجية الشلال",
    "X Bar Control Charts":"مخططات المراقبة",
    "Yellow":"اللون الأصفر",
    "Zero Float":"طريقة المسار الحرج في إدارة المشروع",
    "We are well versed in creating the description of a new facility by representing it in detailed plans and specifications, including construction planning and the allocation of resources required to make the design a physical reality.":"نحن على دراية جيدة في إنشاء وصف لمنشأة جديدة من خلال تمثيلها في الخطط والمواصفات التفصيلية ، بما في ذلك تخطيط البناء وتخصيص الموارد اللازمة لجعل التصميم واقعًا ماديًا.",
    "Consultant in the entertainment and theme parks":"مستشارون في خدمات المنتزهات الترفيهية",
    "Food and beverage service":"تقديم الخدمات المتعلقة بالمأكولات والمشروبات",
    "Training and Human Resources":"التدريب والموارد البشرية",
    "Partnerships with Construction Companies":"شراكات مع شركات المقاولات",
    "Hotels and Resorts":"تشغيل الفنادق والمنتجعات",
    "Water Parks":"تشغيل الحدائق المائية",
    "Moving parks carnival and permanent park":"تشغيل مهرجانات المنتزهات والحدائق المقيمة أو المؤقتة",
    "International shows circus and concerts":"تشغيل عروض السيرك الدولية والحفلات الموسيقية",
    "Safari experience":"تجارب رحلات السفاري ورحلات حدائق الحيوان",
    "Light and sound stages":"مسارح الصوت والضوء",
    "Marketing Place":"أماكن التسويق",
    "Branding Animations and Creativity Team":"فريق الإبداع والرسوم المتحركة للعلامات التجارية",
    "Crowd Management":"إدارة الحشود",
    "IT and Communication":"تكنولوجيا المعلومات والاتصالات",
    "Theme Parks":"مدينة ملاهي",
    "Food":"طعام",
    "Traning":"تدريب",
    "Partnerships":"الشراكه",
    "Hotels":"الفنادق",
    "Moving/Permanent Parks":"متنزهات متحركة / دائمة",
    "Circus": "سيرك",
    "Safari":"سفاري",
    "Light and Sound":"الضوء والصوت",
    "Marketing":"تسويق",
    "Branding Animations":"الرسوم المتحركة للعلامة التجارية",
    "Which are usually a requirement of investors and financing institutions":"والتي عادة ما تكون من متطلبات المستثمرين ومؤسسات التمويل",
    "Offers expert food and beverage consultancy services for businesses in need of concept development":"يقدم خدمات استشارية متخصصة في الأغذية والمشروبات للشركات التي تحتاج إلى تطوير المفاهيم",
    "Offers effective solutions to meet our client's needs":"يقدم حلولاً فعالة لتلبية احتياجات عملائنا",
    "Allow design and construction process to be done within an environment of mutual trust":"السماح بإجراء التصميم والبناء في بيئة من الثقة المتبادلة",
    "Provide consistent growth in the hotels and resorts we operate":"توفير نمو ثابت في الفنادق والمنتجعات التي نعمل بها",
    "Provides short-term and long-term operation services for your water park":"يوفر خدمات تشغيل قصيرة وطويلة الأجل لحديقتك المائية",
    "Providing maintenance services and utilizing best management practices":"تقديم خدمات الصيانة والاستفادة من أفضل الممارسات الإدارية",
    "Only experienced and highly skillful staff like those from FINAL TOUCH can live up to the requirements":"يمكن فقط للموظفين ذوي الخبرة والمهارة العالية مثل هؤلاء من FINAL TOUCH تلبية المتطلبات",
    "Provides a satisfying, rewarding and memorable Safari experience to all our clients":"يوفر تجربة سفاري مرضية ومجزية ولا تنسى لجميع عملائنا",
    "Draw up technical and logistical plans for any kind of event's technology":"وضع الخطط الفنية واللوجستية لأي نوع من تكنولوجيا الحدث",
    "Creating a marketing strategy with us will result in better outcome for your business":"سيؤدي إنشاء استراتيجية تسويق معنا إلى نتائج أفضل لعملك",
    "We'll help you bring your brand to life and make the idea a reality":"سنساعدك على إضفاء الحيوية على علامتك التجارية وجعل الفكرة حقيقة واقعة",
    "FINAL TOUCH believes that your event or festival is important to you":"تؤمن FINAL TOUCH أن هذا الحدث أو المهرجان مهم بالنسبة لك",
    "Without the best IT technical team, organizing a high-quality event is hard to do":"بدون أفضل فريق تقني لتكنولوجيا المعلومات ، يصعب تنظيم حدث عالي الجودة",
    "We carry out these feasibility studies for you so that we can forecast targeted usage by applying market penetrations rates to market segments. These are influenced by market size, demographics, competition and the experience of comparable facilities.":"نقوم بإجراء دراسات الجدوى هذه نيابة عنك حتى نتمكن من توقع الاستخدام المستهدف من خلال تطبيق معدلات اختراق السوق على قطاعات السوق. هذه تتأثر بحجم السوق والتركيبة السكانية والمنافسة وتجربة المرافق المماثلة",
    "To bring your vision to life, we'll help you by accessing our design specialists, conduct market research and analysis, do design branding, financial modelling, recipe development and costing, menu creation, or a full review of processing and procedures to bring your project from conception to grand opening. Our food and beverage consultants are fully capable of taking management roles to integrate solutions and improve operations and revenue for your food and beverage business.":"لإضفاء الحيوية على رؤيتك ، سنساعدك من خلال الوصول إلى متخصصي التصميم لدينا ، وإجراء أبحاث السوق وتحليلها ، والقيام بتصميم العلامة التجارية ، والنمذجة المالية ، وتطوير الوصفات وتحديد التكاليف ، وإنشاء القائمة ، أو مراجعة كاملة للمعالجة والإجراءات لإحضار المشروع من الحمل إلى الافتتاح الكبير. مستشارونا في الأغذية والمشروبات قادرون تمامًا على تولي أدوار إدارية لدمج الحلول وتحسين العمليات والإيرادات لأعمالك في مجال الأغذية والمشروبات",
    "Our HR and talent development professionals provide all-inclusive people-focused HR consulting services tailored to meet client needs. If you're looking for ongoing support or you're seeking assistance with a particular project, you can rely on our team.":"يقدم متخصصو الموارد البشرية وتنمية المواهب لدينا خدمات استشارات موارد بشرية شاملة تركز على الأشخاص ومصممة خصيصًا لتلبية احتياجات العملاء. إذا كنت تبحث عن دعم مستمر أو كنت تبحث عن مساعدة في مشروع معين ، يمكنك الاعتماد على فريقنا",
    "Commitment to shared goals and open communication between the client, architect/engineer, construction manager, general contractor, and subcontractors.":"الالتزام بالأهداف المشتركة والتواصل المفتوح بين العميل والمهندس المعماري ومدير البناء والمقاول العام والمقاولين من الباطن",
    "We guarantee a thrilling guest experience that will keep the visitors coming back, while also providing leadership skills for hotel and resort professionals.":"نحن نضمن تجربة ضيوف مثيرة من شأنها أن تحافظ على عودة الزوار ، مع توفير المهارات القيادية لمحترفي الفنادق والمنتجعات",
    "Daily operation and maintenance of slides and attraction components, such as mechanical, hydraulic and pneumatic devices. Sanitation of attractions and pool water according to local standards, including up-to-date recordkeeping and reporting.":"التشغيل اليومي وصيانة الشرائح ومكونات الجذب ، مثل الأجهزة الميكانيكية والهيدروليكية والهوائية. الصرف الصحي لمناطق الجذب ومياه المسابح وفقًا للمعايير المحلية ، بما في ذلك حفظ السجلات وإعداد التقارير الحديثة",
    "We believe the successful completion of new parks moving parks such as festival parks, carnivals and permanent parks will increase operational requirements. We guarantee our maintenance and operation services will be completed timely and within the given budget.":"نعتقد أن الانتهاء بنجاح من الحدائق الجديدة المتحركة مثل حدائق المهرجانات والكرنفالات والحدائق الدائمة سيزيد من المتطلبات التشغيلية. نحن نضمن اكتمال خدمات الصيانة والتشغيل لدينا في الوقت المناسب وفي حدود الميزانية المحددة",
    "Operating international shows, circus and concerts demand a lot of effort especially when it comes to the equipment used and logistics involved. Domestic and international artists have trusted our expertise and equipment to deliver a successful concert, circuit or international show.":"يتطلب تشغيل العروض الدولية والسيرك والحفلات الموسيقية الكثير من الجهد خاصة عندما يتعلق الأمر بالمعدات المستخدمة والخدمات اللوجستية المعنية. لقد وثق الفنانون المحليون والدوليون بخبرتنا ومعداتنا لتقديم حفل موسيقي ناجح أو حلبة أو عرض دولي",
    "Our competitive rates allow us to offer flexibility and offer great value without interfering with our service delivery. Our experienced ground-handling partners play a very important role in the safari operations thanks to their great knowledge and expertise in all destinations featured.":"تتيح لنا أسعارنا التنافسية توفير المرونة وتقديم قيمة كبيرة دون التدخل في تقديم خدماتنا. يلعب شركاؤنا ذوو الخبرة في المناولة الأرضية دورًا مهمًا للغاية في عمليات السفاري بفضل معرفتهم وخبرتهم الكبيرة في جميع الوجهات المميزة",
    "We'll also combine forces and coordinate with your people who are involved in the project to make sure our timely planning will result in a successful event. All the necessary information will be recorded in specific drawings, plans, packing lists, flowcharts, etc., so that each party can see what, when, where and how something happens, as well who is responsible and how they are involved.":"سنقوم أيضًا بتوحيد القوى والتنسيق مع الأشخاص المشاركين في المشروع للتأكد من أن التخطيط في الوقت المناسب سيؤدي إلى حدث ناجح. سيتم تسجيل جميع المعلومات الضرورية في رسومات وخطط وقوائم تعبئة ومخططات انسيابية محددة وما إلى ذلك ، حتى يتمكن كل طرف من رؤية ماذا ومتى وأين وكيف يحدث شيء ما ، وكذلك من المسؤول وكيف يشارك",
    "The event industry keeps growing but it doesn't mean one can become successful. It requires building a proper marketing strategy and measuring success through metrics such as Registrations, Attendance, Lead generation, Attendee feedback, Brand impressions, New customers":"تستمر صناعة الحدث في النمو ولكن هذا لا يعني أنه يمكن للمرء أن يصبح ناجحًا. يتطلب بناء إستراتيجية تسويق مناسبة وقياس النجاح من خلال مقاييس مثل التسجيلات والحضور وتوليد العملاء وتعليقات الحضور وانطباعات العلامة التجارية والعملاء الجدد",
    "Providing high-quality branding and animation is what we strive for. We'll prepare a professional presentation of your project and have all the necessary materials for you. This includes sketches, illustrations, drawings, renderings, animations, websites, and other creative material.":"نحن نسعى جاهدين لتوفير علامات تجارية ورسوم متحركة عالية الجودة. سنقوم بإعداد عرض تقديمي احترافي لمشروعك وسنوفر لك جميع المواد اللازمة. يتضمن ذلك الرسومات التخطيطية والرسوم التوضيحية والرسومات والعروض والرسوم المتحركة والمواقع الإلكترونية والمواد الإبداعية الأخرى",
    "We can cover every security aspect of the event. Starting from the initial planning of an event, discussing site designs, analysing risk assessments, applying risk reduction measures and contingency plans to make sure that the required levels of supervisory, event and security personnel are well-equipped to provide safety and security services that will help assure the safety of event-goers without compromising the event.":"يمكننا تغطية كل الجوانب الأمنية للحدث. بدءًا من التخطيط الأولي لحدث ما ، ومناقشة تصميمات الموقع ، وتحليل تقييمات المخاطر ، وتطبيق تدابير الحد من المخاطر وخطط الطوارئ للتأكد من أن المستويات المطلوبة من موظفي الإشراف والحدث والأمن مجهزة جيدًا لتوفير خدمات السلامة والأمن التي من شأنها المساعدة في ضمان سلامة رواد الحدث دون المساس بالحدث",
    "Whether you need a single terminal or a complex computer network; wireless devices or a complex matrix intercom; networks for audio, video or data signals – our IT professionals take responsibility for providing it. We use hardware and software from all widely known manufacturers":"ما إذا كنت بحاجة إلى محطة طرفية واحدة أو شبكة كمبيوتر معقدة ؛ أجهزة لاسلكية أو اتصال داخلي معقد مصفوفة ؛ شبكات لإشارات الصوت أو الفيديو أو البيانات - يتحمل متخصصو تكنولوجيا المعلومات لدينا مسؤولية توفيرها. نحن نستخدم الأجهزة والبرامج من جميع الشركات المصنعة المعروفة على نطاق واسع"


}